USE Human_friends;

INSERT INTO cat (Name, Birthday, Commands, Genus_id)
VALUES ('Мурка', '2022-06-07', 'Выполни круг', 1),
('Барсик', '2021-02-03', "Сядь", 1),
('Симба', '2020-03-05', "Лежать", 1); 


INSERT INTO dog (Name, Birthday, Commands, Genus_id)
VALUES ('Арчи', '2021-03-07', 'ко мне, лежать, лапу, голос', 2),
('Луна', '2022-06-11', "сидеть, лежать, лапу", 2),
('Хантер', '2020-05-03', "сидеть, лежать, лапу, след, фас", 2), 
('Мухтар', '2021-07-12', "сидеть, лежать, фу, место", 2);

INSERT INTO hamster (Name, Birthday, Commands, Genus_id)
VALUES ('Кроха', '2021-10-10', '', 3),
('Хома', '2020-02-12', "Хома, иди сюда!", 3),
('Рыжик', '2021-08-12', NULL, 3), 
('Кексик', '2022-06-09', NULL, 3);

INSERT INTO horse (Name, Birthday, Commands, Genus_id)
VALUES ('Гром', '2020-05-11', 'бегом, шагом', 1),
('Ветер', '2020-05-11', "бегом, шагом, хоп", 1),
('Янтарь', '2015-08-11', "бегом, шагом, хоп, брр", 1), 
('Дымка', '2019-07-10', "бегом, шагом, хоп", 1);

INSERT INTO donkey (Name, Birthday, Commands, Genus_id)
VALUES ('Васька', '2021-04-10', NULL, 2),
('Здоровяк', '2019-08-11', "", 2),
('Ушастик', '2020-07-10', "", 2), 
('Упрямец', '2021-10-11', NULL, 2);

INSERT INTO camel (Name, Birthday, Commands, Genus_id)
VALUES ('Сахарок', '2020-04-10', 'лечь', 3),
('Бактриан', '2018-03-12', "иди медленно", 3),
('Лама', '2017-07-12', "повернись", 3), 
('Пустыня', '2020-12-10', "стой", 3);